Revit 2027 API
BuiltInFailures.GeneralFailures.NoRelatedWarnings Property
 Document doesn't contain any warnings related to these elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRelatedWarnings { get; }
Public Shared ReadOnly Property NoRelatedWarnings As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRelatedWarnings {
	FailureDefinitionId^ get ();
}
static member NoRelatedWarnings : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace